# GetCustomHandles Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarHandlesData..::..GetCustomHandles Method
RebarHandlesData Class See Also
---
Gets the handle definitions for the rebar that were added.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public IList<int> GetCustomHandles()
```

Visual Basic
---
```text
Public Function GetCustomHandles As IList(Of Integer)
```

Visual C++
---
```text
public:
IList<int>^ GetCustomHandles()
```

# ### Return Value
Returns all custom handles.
# See Also
RebarHandlesData Class
Autodesk.Revit.DB.Structure Namespace